---
kind: type
id: T:Autodesk.Revit.DB.BuiltInFailures.UniqueElementFailures
source: html/390aed66-9220-3c03-d1ed-d1a42e79225a.htm
---
# Autodesk.Revit.DB.BuiltInFailures.UniqueElementFailures

## Syntax (C#)
```csharp
public static class UniqueElementFailures
```